class WhileVSFor2 
{
	public static void main(String[] args) 
	{
	//for문으로 짜던 삼각형 그리기를 while문으로 해본다.
		int x=0,y=0;	
		
		while(x<5)
		{
			while(y<5)
			{
			}
			System.out.println();
			y=0;
		}


		/*
		(ex2)
		*****
		****
		***
		**
		*
		*/


		/*
		(ex3)
			*
		   **
		  ***
		 ****
		*****
		-----------------------
		(ex4)
		*****
		 ****
		  ***
		   **
			*
		---------------------
		(ex5)
			  *
			 ***	
			*****
		   *******
		  *********	
		---------------------
		(ex6)
			 *
			***
		   *****
			***
             *
		*/
	}
}
